Chenwhich778/EDC_Control/car_driver_mspm0/car_driver_mspm0/Debug/syscfg/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for PWM_G0 */
#define PWM_G0_INST                                                        TIMG0
#define PWM_G0_INST_IRQHandler                                  TIMG0_IRQHandler
#define PWM_G0_INST_INT_IRQN                                    (TIMG0_INT_IRQn)
#define PWM_G0_INST_CLK_FREQ                                              400000
/* GPIO defines for channel 0 */
#define GPIO_PWM_G0_C0_PORT                                                GPIOA
#define GPIO_PWM_G0_C0_PIN                                        DL_GPIO_PIN_23
#define GPIO_PWM_G0_C0_IOMUX                                     (IOMUX_PINCM53)
#define GPIO_PWM_G0_C0_IOMUX_FUNC                    IOMUX_PINCM53_PF_TIMG0_CCP0
#define GPIO_PWM_G0_C0_IDX                                   DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_G0_C1_PORT                                                GPIOA
#define GPIO_PWM_G0_C1_PIN                                        DL_GPIO_PIN_13
#define GPIO_PWM_G0_C1_IOMUX                                     (IOMUX_PINCM35)
#define GPIO_PWM_G0_C1_IOMUX_FUNC                    IOMUX_PINCM35_PF_TIMG0_CCP1
#define GPIO_PWM_G0_C1_IDX                                   DL_TIMER_CC_1_INDEX

/* Defines for PWM_MOTOR_1_2 */
#define PWM_MOTOR_1_2_INST                                                 TIMG7
#define PWM_MOTOR_1_2_INST_IRQHandler                           TIMG7_IRQHandler
#define PWM_MOTOR_1_2_INST_INT_IRQN                             (TIMG7_INT_IRQn)
#define PWM_MOTOR_1_2_INST_CLK_FREQ                                     32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_MOTOR_1_2_C0_PORT                                         GPIOA
#define GPIO_PWM_MOTOR_1_2_C0_PIN                                 DL_GPIO_PIN_26
#define GPIO_PWM_MOTOR_1_2_C0_IOMUX                              (IOMUX_PINCM59)
#define GPIO_PWM_MOTOR_1_2_C0_IOMUX_FUNC             IOMUX_PINCM59_PF_TIMG7_CCP0
#define GPIO_PWM_MOTOR_1_2_C0_IDX                            DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_MOTOR_1_2_C1_PORT                                         GPIOA
#define GPIO_PWM_MOTOR_1_2_C1_PIN                                  DL_GPIO_PIN_4
#define GPIO_PWM_MOTOR_1_2_C1_IOMUX                               (IOMUX_PINCM9)
#define GPIO_PWM_MOTOR_1_2_C1_IOMUX_FUNC              IOMUX_PINCM9_PF_TIMG7_CCP1
#define GPIO_PWM_MOTOR_1_2_C1_IDX                            DL_TIMER_CC_1_INDEX

/* Defines for PWM_MOTOR_3_4 */
#define PWM_MOTOR_3_4_INST                                                 TIMG6
#define PWM_MOTOR_3_4_INST_IRQHandler                           TIMG6_IRQHandler
#define PWM_MOTOR_3_4_INST_INT_IRQN                             (TIMG6_INT_IRQn)
#define PWM_MOTOR_3_4_INST_CLK_FREQ                                     32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_MOTOR_3_4_C0_PORT                                         GPIOA
#define GPIO_PWM_MOTOR_3_4_C0_PIN                                 DL_GPIO_PIN_29
#define GPIO_PWM_MOTOR_3_4_C0_IOMUX                               (IOMUX_PINCM4)
#define GPIO_PWM_MOTOR_3_4_C0_IOMUX_FUNC              IOMUX_PINCM4_PF_TIMG6_CCP0
#define GPIO_PWM_MOTOR_3_4_C0_IDX                            DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_MOTOR_3_4_C1_PORT                                         GPIOA
#define GPIO_PWM_MOTOR_3_4_C1_PIN                                 DL_GPIO_PIN_30
#define GPIO_PWM_MOTOR_3_4_C1_IOMUX                               (IOMUX_PINCM5)
#define GPIO_PWM_MOTOR_3_4_C1_IOMUX_FUNC              IOMUX_PINCM5_PF_TIMG6_CCP1
#define GPIO_PWM_MOTOR_3_4_C1_IDX                            DL_TIMER_CC_1_INDEX



