Chenwhich778/EDC_Control/car_driver_mspm0/car_driver_mspm0/Debug/syscfg/ti_msp_dl_config.h
/* Defines for TIMER_M4 */
#define TIMER_M4_INST                                                    (TIMA1)
#define TIMER_M4_INST_IRQHandler                                TIMA1_IRQHandler
#define TIMER_M4_INST_INT_IRQN                                  (TIMA1_INT_IRQn)
/* GPIO defines for channel 1 */
#define GPIO_TIMER_M4_C1_PORT                                              GPIOB
#define GPIO_TIMER_M4_C1_PIN                                      DL_GPIO_PIN_18
#define GPIO_TIMER_M4_C1_IOMUX                                   (IOMUX_PINCM44)
#define GPIO_TIMER_M4_C1_IOMUX_FUNC                  IOMUX_PINCM44_PF_TIMA1_CCP1

/* Defines for TIMER_M3 */
#define TIMER_M3_INST                                                    (TIMG8)
#define TIMER_M3_INST_IRQHandler                                TIMG8_IRQHandler
#define TIMER_M3_INST_INT_IRQN                                  (TIMG8_INT_IRQn)
/* GPIO defines for channel 0 */
#define GPIO_TIMER_M3_C0_PORT                                              GPIOB
#define GPIO_TIMER_M3_C0_PIN                                      DL_GPIO_PIN_21
#define GPIO_TIMER_M3_C0_IOMUX                                   (IOMUX_PINCM49)
#define GPIO_TIMER_M3_C0_IOMUX_FUNC                  IOMUX_PINCM49_PF_TIMG8_CCP0




/* Defines for TIMER_A0_100us */
#define TIMER_A0_100us_INST                                              (TIMA0)
#define TIMER_A0_100us_INST_IRQHandler                          TIMA0_IRQHandler
#define TIMER_A0_100us_INST_INT_IRQN                            (TIMA0_INT_IRQn)
#define TIMER_A0_100us_INST_LOAD_VALUE                                    (159U)
/* Defines for TIMER_G12_1ms */
#define TIMER_G12_1ms_INST                                              (TIMG12)
#define TIMER_G12_1ms_INST_IRQHandler                          TIMG12_IRQHandler
#define TIMER_G12_1ms_INST_INT_IRQN                            (TIMG12_INT_IRQn)
#define TIMER_G12_1ms_INST_LOAD_VALUE                                    (3199U)




/* Defines for I2C_0 */
#define I2C_0_INST                                                          I2C0
#define I2C_0_INST_IRQHandler                                    I2C0_IRQHandler
#define I2C_0_INST_INT_IRQN                                        I2C0_INT_IRQn
#define I2C_0_BUS_SPEED_HZ                                                100000
#define GPIO_I2C_0_SDA_PORT                                                GPIOA
#define GPIO_I2C_0_SDA_PIN                                        DL_GPIO_PIN_28
#define GPIO_I2C_0_IOMUX_SDA                                      (IOMUX_PINCM3)
#define GPIO_I2C_0_IOMUX_SDA_FUNC                       IOMUX_PINCM3_PF_I2C0_SDA
#define GPIO_I2C_0_SCL_PORT                                                GPIOA
#define GPIO_I2C_0_SCL_PIN                                        DL_GPIO_PIN_31
#define GPIO_I2C_0_IOMUX_SCL                                      (IOMUX_PINCM6)
#define GPIO_I2C_0_IOMUX_SCL_FUNC                       IOMUX_PINCM6_PF_I2C0_SCL


/* Defines for USB_UART_0 */
#define USB_UART_0_INST                                                    UART0
#define USB_UART_0_INST_FREQUENCY                                       32000000
#define USB_UART_0_INST_IRQHandler                              UART0_IRQHandler
#define USB_UART_0_INST_INT_IRQN                                  UART0_INT_IRQn
#define GPIO_USB_UART_0_RX_PORT                                            GPIOA
#define GPIO_USB_UART_0_TX_PORT                                            GPIOA
#define GPIO_USB_UART_0_RX_PIN                                     DL_GPIO_PIN_1
#define GPIO_USB_UART_0_TX_PIN                                     DL_GPIO_PIN_0
#define GPIO_USB_UART_0_IOMUX_RX                                  (IOMUX_PINCM2)
#define GPIO_USB_UART_0_IOMUX_TX                                  (IOMUX_PINCM1)
#define GPIO_USB_UART_0_IOMUX_RX_FUNC                   IOMUX_PINCM2_PF_UART0_RX
#define GPIO_USB_UART_0_IOMUX_TX_FUNC                   IOMUX_PINCM1_PF_UART0_TX
#define USB_UART_0_BAUD_RATE                                            (115200)
#define USB_UART_0_IBRD_32_MHZ_115200_BAUD                                  (17)
#define USB_UART_0_FBRD_32_MHZ_115200_BAUD                                  (23)
/* Defines for UART_1 */
#define UART_1_INST                                                        UART1
#define UART_1_INST_FREQUENCY                                           32000000
#define UART_1_INST_IRQHandler                                  UART1_IRQHandler
#define UART_1_INST_INT_IRQN                                      UART1_INT_IRQn
#define GPIO_UART_1_TX_PORT                                                GPIOA
#define GPIO_UART_1_TX_PIN                                        DL_GPIO_PIN_17
#define GPIO_UART_1_IOMUX_TX                                     (IOMUX_PINCM39)
#define GPIO_UART_1_IOMUX_TX_FUNC                      IOMUX_PINCM39_PF_UART1_TX
#define UART_1_BAUD_RATE                                                (115200)
#define UART_1_IBRD_32_MHZ_115200_BAUD                                      (17)
#define UART_1_FBRD_32_MHZ_115200_BAUD                                      (23)
/* Defines for UART_0 */
#define UART_0_INST                                                        UART2
#define UART_0_INST_FREQUENCY                                           32000000
#define UART_0_INST_IRQHandler                                  UART2_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART2_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_22
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_21
#define GPIO_UART_0_IOMUX_RX                                     (IOMUX_PINCM47)
#define GPIO_UART_0_IOMUX_TX                                     (IOMUX_PINCM46)
#define GPIO_UART_0_IOMUX_RX_FUNC                      IOMUX_PINCM47_PF_UART2_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                      IOMUX_PINCM46_PF_UART2_TX
#define UART_0_BAUD_RATE                                                  (9600)
#define UART_0_IBRD_32_MHZ_9600_BAUD                                       (208)
#define UART_0_FBRD_32_MHZ_9600_BAUD                                        (21)




/* Defines for SPI_0 */
#define SPI_0_INST                                                         SPI0
#define SPI_0_INST_IRQHandler                                   SPI0_IRQHandler
#define SPI_0_INST_INT_IRQN                                       SPI0_INT_IRQn
#define GPIO_SPI_0_PICO_PORT                                              GPIOA
#define GPIO_SPI_0_PICO_PIN                                      DL_GPIO_PIN_14
#define GPIO_SPI_0_IOMUX_PICO                                   (IOMUX_PINCM36)
#define GPIO_SPI_0_IOMUX_PICO_FUNC                   IOMUX_PINCM36_PF_SPI0_PICO
#define GPIO_SPI_0_POCI_PORT                                              GPIOA
#define GPIO_SPI_0_POCI_PIN                                      DL_GPIO_PIN_10
#define GPIO_SPI_0_IOMUX_POCI                                   (IOMUX_PINCM21)
#define GPIO_SPI_0_IOMUX_POCI_FUNC                   IOMUX_PINCM21_PF_SPI0_POCI
/* GPIO configuration for SPI_0 */
#define GPIO_SPI_0_SCLK_PORT                                              GPIOA
#define GPIO_SPI_0_SCLK_PIN                                      DL_GPIO_PIN_11
#define GPIO_SPI_0_IOMUX_SCLK                                   (IOMUX_PINCM22)
#define GPIO_SPI_0_IOMUX_SCLK_FUNC                   IOMUX_PINCM22_PF_SPI0_SCLK



