Chenwhich778/EDC_Control/car_driver_mspm0/car_driver_mspm0/Debug/syscfg/ti_msp_dl_config.h
/* Defines for VCC_ADC */
#define VCC_ADC_INST                                                        ADC1
#define VCC_ADC_INST_IRQHandler                                  ADC1_IRQHandler
#define VCC_ADC_INST_INT_IRQN                                    (ADC1_INT_IRQn)
#define VCC_ADC_ADCMEM_0                                      DL_ADC12_MEM_IDX_0
#define VCC_ADC_ADCMEM_0_REF                     DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define VCC_ADC_ADCMEM_0_REF_VOLTAGE_V                                       3.3
#define GPIO_VCC_ADC_C0_PORT                                               GPIOA
#define GPIO_VCC_ADC_C0_PIN                                       DL_GPIO_PIN_15

/* Defines for ADC12_0 */
#define ADC12_0_INST                                                        ADC0
#define ADC12_0_INST_IRQHandler                                  ADC0_IRQHandler
#define ADC12_0_INST_INT_IRQN                                    (ADC0_INT_IRQn)
#define ADC12_0_ADCMEM_0                                      DL_ADC12_MEM_IDX_0
#define ADC12_0_ADCMEM_0_REF                     DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC12_0_ADCMEM_0_REF_VOLTAGE_V                                       3.3
#define GPIO_ADC12_0_C0_PORT                                               GPIOA
#define GPIO_ADC12_0_C0_PIN                                       DL_GPIO_PIN_27



/* Port definition for Pin Group KEY1 */
#define KEY1_PORT                                                        (GPIOB)

/* Defines for PB5: GPIOB.5 with pinCMx 18 on package pin 53 */
// groups represented: ["MOTOR1","MOTOR2","MOTOR4","KEY1"]
// pins affected: ["ENCA1","ENCA2","ENCA4","PB5"]
#define GPIO_MULTIPLE_GPIOB_INT_IRQN                            (GPIOB_INT_IRQn)
#define GPIO_MULTIPLE_GPIOB_INT_IIDX            (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define KEY1_PB5_IIDX                                        (DL_GPIO_IIDX_DIO5)
#define KEY1_PB5_PIN                                             (DL_GPIO_PIN_5)
#define KEY1_PB5_IOMUX                                           (IOMUX_PINCM18)
/* Port definition for Pin Group SPI0 */
#define SPI0_PORT                                                        (GPIOA)

/* Defines for CS0: GPIOA.8 with pinCMx 19 on package pin 54 */
#define SPI0_CS0_PIN                                             (DL_GPIO_PIN_8)
#define SPI0_CS0_IOMUX                                           (IOMUX_PINCM19)
/* Defines for RESET: GPIOB.9 with pinCMx 26 on package pin 61 */
#define OLED_RESET_PORT                                                  (GPIOB)
#define OLED_RESET_PIN                                           (DL_GPIO_PIN_9)
#define OLED_RESET_IOMUX                                         (IOMUX_PINCM26)
/* Defines for DC: GPIOB.10 with pinCMx 27 on package pin 62 */
#define OLED_DC_PORT                                                     (GPIOB)
#define OLED_DC_PIN                                             (DL_GPIO_PIN_10)
#define OLED_DC_IOMUX                                            (IOMUX_PINCM27)
/* Defines for CS: GPIOA.3 with pinCMx 8 on package pin 43 */
#define OLED_CS_PORT                                                     (GPIOA)
#define OLED_CS_PIN                                              (DL_GPIO_PIN_3)
#define OLED_CS_IOMUX                                             (IOMUX_PINCM8)
/* Defines for CTRL1: GPIOB.13 with pinCMx 30 on package pin 1 */
#define MOTOR1_CTRL1_PORT                                                (GPIOB)
#define MOTOR1_CTRL1_PIN                                        (DL_GPIO_PIN_13)
#define MOTOR1_CTRL1_IOMUX                                       (IOMUX_PINCM30)
/* Defines for CTRL2: GPIOB.17 with pinCMx 43 on package pin 14 */
#define MOTOR1_CTRL2_PORT                                                (GPIOB)
#define MOTOR1_CTRL2_PIN                                        (DL_GPIO_PIN_17)
#define MOTOR1_CTRL2_IOMUX                                       (IOMUX_PINCM43)
/* Defines for ENCA1: GPIOB.14 with pinCMx 31 on package pin 2 */
#define MOTOR1_ENCA1_PORT                                                (GPIOB)
#define MOTOR1_ENCA1_IIDX                                   (DL_GPIO_IIDX_DIO14)
#define MOTOR1_ENCA1_PIN                                        (DL_GPIO_PIN_14)
#define MOTOR1_ENCA1_IOMUX                                       (IOMUX_PINCM31)
/* Defines for ENCB1: GPIOA.12 with pinCMx 34 on package pin 5 */
#define MOTOR1_ENCB1_PORT                                                (GPIOA)
#define MOTOR1_ENCB1_PIN                                        (DL_GPIO_PIN_12)
#define MOTOR1_ENCB1_IOMUX                                       (IOMUX_PINCM34)
/* Defines for CTRL3: GPIOA.25 with pinCMx 55 on package pin 26 */
#define MOTOR2_CTRL3_PORT                                                (GPIOA)
#define MOTOR2_CTRL3_PIN                                        (DL_GPIO_PIN_25)
#define MOTOR2_CTRL3_IOMUX                                       (IOMUX_PINCM55)
/* Defines for CTRL4: GPIOB.26 with pinCMx 57 on package pin 28 */
#define MOTOR2_CTRL4_PORT                                                (GPIOB)
#define MOTOR2_CTRL4_PIN                                        (DL_GPIO_PIN_26)
#define MOTOR2_CTRL4_IOMUX                                       (IOMUX_PINCM57)
/* Defines for ENCA2: GPIOB.23 with pinCMx 51 on package pin 22 */
#define MOTOR2_ENCA2_PORT                                                (GPIOB)
#define MOTOR2_ENCA2_IIDX                                   (DL_GPIO_IIDX_DIO23)
#define MOTOR2_ENCA2_PIN                                        (DL_GPIO_PIN_23)
#define MOTOR2_ENCA2_IOMUX                                       (IOMUX_PINCM51)
/* Defines for ENCB2: GPIOB.22 with pinCMx 50 on package pin 21 */
#define MOTOR2_ENCB2_PORT                                                (GPIOB)
#define MOTOR2_ENCB2_PIN                                        (DL_GPIO_PIN_22)
#define MOTOR2_ENCB2_IOMUX                                       (IOMUX_PINCM50)
/* Defines for CTRL5: GPIOB.27 with pinCMx 58 on package pin 29 */
#define MOTOR3_CTRL5_PORT                                                (GPIOB)
#define MOTOR3_CTRL5_PIN                                        (DL_GPIO_PIN_27)
#define MOTOR3_CTRL5_IOMUX                                       (IOMUX_PINCM58)
/* Defines for CTRL6: GPIOA.5 with pinCMx 10 on package pin 45 */
#define MOTOR3_CTRL6_PORT                                                (GPIOA)
#define MOTOR3_CTRL6_PIN                                         (DL_GPIO_PIN_5)
#define MOTOR3_CTRL6_IOMUX                                       (IOMUX_PINCM10)
/* Defines for ENCB3: GPIOB.20 with pinCMx 48 on package pin 19 */
#define MOTOR3_ENCB3_PORT                                                (GPIOB)
#define MOTOR3_ENCB3_PIN                                        (DL_GPIO_PIN_20)
#define MOTOR3_ENCB3_IOMUX                                       (IOMUX_PINCM48)
/* Defines for CTRL7: GPIOA.6 with pinCMx 11 on package pin 46 */
#define MOTOR4_CTRL7_PORT                                                (GPIOA)
#define MOTOR4_CTRL7_PIN                                         (DL_GPIO_PIN_6)
#define MOTOR4_CTRL7_IOMUX                                       (IOMUX_PINCM11)
/* Defines for CTRL8: GPIOB.1 with pinCMx 13 on package pin 48 */
#define MOTOR4_CTRL8_PORT                                                (GPIOB)
#define MOTOR4_CTRL8_PIN                                         (DL_GPIO_PIN_1)
#define MOTOR4_CTRL8_IOMUX                                       (IOMUX_PINCM13)
/* Defines for ENCA4: GPIOB.19 with pinCMx 45 on package pin 16 */
#define MOTOR4_ENCA4_PORT                                                (GPIOB)
#define MOTOR4_ENCA4_IIDX                                   (DL_GPIO_IIDX_DIO19)
#define MOTOR4_ENCA4_PIN                                        (DL_GPIO_PIN_19)
#define MOTOR4_ENCA4_IOMUX                                       (IOMUX_PINCM45)
/* Defines for G: GPIOA.24 with pinCMx 54 on package pin 25 */
#define RGB_GB_G_PORT                                                    (GPIOA)
#define RGB_GB_G_PIN                                            (DL_GPIO_PIN_24)
#define RGB_GB_G_IOMUX                                           (IOMUX_PINCM54)
/* Defines for B: GPIOB.0 with pinCMx 12 on package pin 47 */
#define RGB_GB_B_PORT                                                    (GPIOB)
#define RGB_GB_B_PIN                                             (DL_GPIO_PIN_0)
#define RGB_GB_B_IOMUX                                           (IOMUX_PINCM12)
/* Defines for H2: GPIOB.2 with pinCMx 15 on package pin 50 */
#define KEY_H2_PORT                                                      (GPIOB)
#define KEY_H2_PIN                                               (DL_GPIO_PIN_2)
#define KEY_H2_IOMUX                                             (IOMUX_PINCM15)
/* Defines for H3: GPIOB.15 with pinCMx 32 on package pin 3 */
#define KEY_H3_PORT                                                      (GPIOB)
#define KEY_H3_PIN                                              (DL_GPIO_PIN_15)
#define KEY_H3_IOMUX                                             (IOMUX_PINCM32)
/* Defines for H4: GPIOA.2 with pinCMx 7 on package pin 42 */
#define KEY_H4_PORT                                                      (GPIOA)
#define KEY_H4_PIN                                               (DL_GPIO_PIN_2)
#define KEY_H4_IOMUX                                              (IOMUX_PINCM7)
/* Defines for V1: GPIOB.11 with pinCMx 28 on package pin 63 */
#define KEY_V1_PORT                                                      (GPIOB)
#define KEY_V1_PIN                                              (DL_GPIO_PIN_11)
#define KEY_V1_IOMUX                                             (IOMUX_PINCM28)
/* Defines for V2: GPIOB.3 with pinCMx 16 on package pin 51 */
#define KEY_V2_PORT                                                      (GPIOB)
#define KEY_V2_PIN                                               (DL_GPIO_PIN_3)
#define KEY_V2_IOMUX                                             (IOMUX_PINCM16)
/* Defines for V3: GPIOA.16 with pinCMx 38 on package pin 9 */
#define KEY_V3_PORT                                                      (GPIOA)
#define KEY_V3_PIN                                              (DL_GPIO_PIN_16)
#define KEY_V3_IOMUX                                             (IOMUX_PINCM38)
/* Defines for V4: GPIOB.16 with pinCMx 33 on package pin 4 */
#define KEY_V4_PORT                                                      (GPIOB)
#define KEY_V4_PIN                                              (DL_GPIO_PIN_16)
#define KEY_V4_IOMUX                                             (IOMUX_PINCM33)
/* Defines for H1: GPIOB.4 with pinCMx 17 on package pin 52 */
#define KEY_H1_PORT                                                      (GPIOB)
#define KEY_H1_PIN                                               (DL_GPIO_PIN_4)
#define KEY_H1_IOMUX                                             (IOMUX_PINCM17)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_PWM_G0_init(void);
void SYSCFG_DL_PWM_MOTOR_1_2_init(void);
void SYSCFG_DL_PWM_MOTOR_3_4_init(void);
void SYSCFG_DL_TIMER_M4_init(void);
void SYSCFG_DL_TIMER_M3_init(void);
void SYSCFG_DL_TIMER_A0_100us_init(void);
void SYSCFG_DL_TIMER_G12_1ms_init(void);
void SYSCFG_DL_I2C_0_init(void);
void SYSCFG_DL_USB_UART_0_init(void);
void SYSCFG_DL_UART_1_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_SPI_0_init(void);
void SYSCFG_DL_VCC_ADC_init(void);
void SYSCFG_DL_ADC12_0_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
